package org.bot.view;

public class Handlers
{
    public String StartMessage()
    {
        return """
               === Анонимная Чат-Рулетка (Chain Chat) ===
               Вы получаете случайное сообщение от незнакомца.
               Напишите ответ, и вся история чата отправится СЛЕДУЮЩЕМУ случайному человеку!

               Команды:
               /help - Инструкции
               /new  - Начать новую цепочку сообщений
               /skip - Пропустить текущий чат и получить другой
               """;
    }

    public String HelpMessage()
    {
        return """
               --- Справка ---
               - Введите любой текст, чтобы ответить на текущее сообщение и отправить чат дальше
               - /new  - Создать совершенно новый чат и написать первое сообщение
               - /skip - Сбросить текущую цепочку и взять новую из пула
               """;
    }

    public String NewChat()
    {
        return """
                Вы создали новый чат. Отправьте первое сообщение!
                """;
    }

    public String SkipChat()
    {
        return """
                скипаем...
                """;
    }
}